src/Documents/ЗапрещенныйАссортимент/ЗапрещенныйАссортимент.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗапрещенныйАссортимент</name>
  <registerRecords>InformationRegister.ЗапрещенныйКОтгрузкеАссортимент</registerRecords>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакУстановкиСнятия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Ассортимент</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/ЗапрещенныйКОтгрузкеАссортимент/ЗапрещенныйКОтгрузкеАссортимент.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗапрещенныйКОтгрузкеАссортимент</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>ПризнакСнятия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ЗапрещенныйАссортимент/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ЗапрещенныйКОтгрузкеАссортимент.Записывать = Истина;
	Движения.ЗапрещенныйКОтгрузкеАссортимент.Очистить();
	Для Каждого ТекСтрокаАссортимент Из Ассортимент Цикл
		Движение = Движения.ЗапрещенныйКОтгрузкеАссортимент.Добавить();
		Движение.Период=Дата;
		Движение.Контрагент = Контрагент;
		Движение.Подразделение = Подразделение;
		Движение.Номенклатура = ТекСтрокаАссортимент.Номенклатура;
		Движение.ПризнакСнятия = ПризнакУстановкиСнятия;
	КонецЦикла;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ЭтотОбъект.ЭтоНовый() Тогда
		Ответственный=глЗначениеПеременной("глТекущийПользователь");
	КонецЕсли; 
КонецПроцедуры
